Repository: LanaBallouli/ICash
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Welcome back
ar: مرحبًا بعودتك

source: Create An Account
ar: إنشاء حساب

# please_login
source: Please login to your account
ar: يرجى تسجيل الدخول إلى حسابك

# please_fill
source: Please fill in your details
ar: يرجى تعبئة بيانات حسابك

source: Email
ar: ايميل

source: User name
ar: اسم المستخدم

# enter_name
source: Enter your name
ar: أدخل اسم المستخدم

source: Phone
ar: رقم الهاتف

# phone_hint
source: Enter your phone number
ar: أدخل رقم هاتفك

source: Password
ar: كلمة المرور

# password_hint
source: Enter your password
ar: أدخل كلمة المرور الخاصة بك

# confirm
source: Confirm password
ar: تأكيد كلمة المرور

# confirm_hint
source: Re-enter your password
ar: أعد كتابة كلمة المرور هنا

# login_button
source: Login
ar: تسجيل الدخول

# forgot_password
source: Forget password?
ar: نسيت كلمة المرور؟

# signup_prompt
source: Donâ€™t have an account?
ar: ليس لديك حساب؟

# login_prompt
source: Already have an account?
ar: لديك حساب بالفعل؟

# signup_button
source: Sign Up
ar: انشئ حساب

# email_error
source: Please enter a valid email
ar: يرجى ادخال ايميل صحيح

# phone_error
source: Please enter a valid phone number
ar: يرجى ادخال رقم هاتف صحيح

# password_error
source: Password must be strong
ar: يرجى ادخال كلمة مرور صحيحة

# password_mismatch_error
source: Passwords do not match
ar: كلمات المرور غير متطابقة

# name_error
source: Name cannot be empty
ar: الاسم لا يمكن أن يكون فارغًا

# fix_errors_message
source: Please fix the errors before proceeding
ar: يرجى إصلاح الأخطاء قبل المتابعة

source: Main Screen
ar: الرئيسية

source: Hi
ar: أهلاً

# morning
source: Good morning
ar: صباح الخير

source: Search
ar: بحث

source: Progress
ar: التقدم

source: Monthly Target
ar: الهدف الشهري

source: Daily Sales
ar: المبيعات اليومية

# active_rep
source: Active Sales Representatives
ar: المندوبين النشطين

# num_active_rep
source: Number of Active Representatives:
ar: عدد المندوبين النشطين

source: Debts
ar: الذمم المعلقة

source: Dashboard
ar: لوحة التحكم

# debts_num
source: Number of unpaid invoices:
ar: عدد الفواتير غير المسددة

source: Total Debts:
ar: إجمالي الذمم المعلقة

source: Quick Access
ar: الوصول السريع

source: Create Invoice
ar: إنشاء فاتورة

# create_invoice_prompt
source: Fill in the fields to create an invoice:
ar: قم بتعبئة الحقول لإنشاء فاتورة

source: Invoice Type:
ar: نوع الفاتورة

# invoice_num
source: Invoice NO.
ar: رقم الفاتورة

source: Select Invoice Type:
ar: اختر نوع الفاتورة

source: Cash Invoice
ar: فاتورة نقدية

source: Debt Invoice
ar: فاتورة ذمم

source: Account Statement
ar: كشف حساب

source: Accept Debts
ar: الموافقة على الذمم

# set_path
source: Set Paths
ar: تحديد المسارات

# add_goal
source: Add New Target
ar: إضافة هدف شهري جديد

# goal_amount
source: Target Amount
ar: قيمة الهدف

source: Save
ar: حفظ

source: Cancel
ar: إلغاء

# fill_all_fields
source: Please fill in all the fields
ar: املىء جميع الحقول

# invalid_amount
source: Please enter a valid amount
ar: ادخل قيمة صحيحة

source: Email already taken
ar: هذا الايميل مستخدم بالفعل

# signup_successful_message
source: Sign up successfully
ar: تم التسجيل بنجاح

# error
source: an error occurred
ar: حدث خطأ

source: Sign up failed
ar: فشل تسجيل الدخول

# verify_email
source: Verify Your Email
ar: التحقق من بريدك الإلكتروني

# verification_message
source: A verification email has been sent to your inbox. Please verify your email to continue.
ar: تم إرسال رسالة تحقق إلى بريدك الإلكتروني. يرجى التحقق من بريدك الإلكتروني للمتابعة.

source: Remember me
ar: تذكرني

# empty_monthly_target
source: No monthly targets found. Please add a new target to get started.
ar: لم يتم العثور على أهداف شهرية. يرجى إضافة هدف جديد للبدء.

source: Error Loading Data
ar: خطأ في تحميل البيانات

source: Month
ar: الشهر

source: Year
ar: السنة

# fill_in
source: Please fill in the fields below to add a new goal
ar: يرجى ملء الحقول أدناه لإضافة هدف جديد

source: Ok
ar: حسنًا

# success_target
source: Monthly target inserted successfully
ar: تم إنشاء هدف شهري بنجاح

source: Client Name
ar: اسم العميل

source: Select Client Name
ar: اختر اسم العميل

source: Select Products
ar: اختر المنتجات

source: Select Product
ar: اختر منتج

source: Item:
ar: المنتج

source: Add Item
ar: إضافة منتج

source: Notifications
ar: الإشعارات

source: Tax number
ar: الرقم الضريبي

source: Products
ar: المنتجات

source: No Clients
ar: لا يوجد عملاء

source: No Products
ar: لا يوجد منتجات

source: Category
ar: الفئة

source: Select category:
ar: اختر الفئة

source: Amount:
ar: الكمية

source: Discount
ar: الخصم

# enter_discount
source: Enter discount amount:
ar: أدخل قيمة الخصم

# tax
source: Tax amount:
ar: قيمة الضريبة

# enter_tax
source: Enter tax amount
ar: أدخل قيمة الضريبة

source: SubTotal:
ar: المجموع الجزئي

source: Date:
ar: تاريخ اليوم

source: Total:
ar: المجموع الكلي

source: Cash
ar: نقدي

source: Debt
ar: ذمم

# add_item_prompt
source: Fill in all fields to add an item:
ar: قم بتعبئة الحقول لإضافة منتج

source: Unit price:
ar: سعر الوحدة

source: Failed to create user profile
ar: فشل إنشاء مستخدم جديد

source: Login failed
ar: فشل تسجيل الدخول

source: User already registered
ar: هذا المستخدم مسجل بالفعل

source: Management Screen
ar: الإدارة

source: Sales Men
ar: المندوبين

source: Clients
ar: العملاء

# remove_from_favorites_confirmation
source: Are you sure you want to remove it from favorites?
ar: هل أنت متأكد أنك تريد إزالته من المفضلة؟

source: Yes
ar: نعم

source: More details
ar: تفاصيل أكثر

# profile
source: Profile Section
ar: الملف الشخصي

source: Performance
ar: الأداء

source: Recent Activity Log
ar: سجل الأنشطة الأخيرة

source: Assigned Clients
ar: العملاء المعينون

source: Assigned Salesmen
ar: المندوبين المعينون

source: Sales Reports
ar: تقارير المبيعات

source: Attendance and Work Hours
ar: الحضور وساعات العمل

source: Feedback
ar: ملاحظات

source: Role
ar: الدور

source: Region
ar: المنطقة

source: Status
ar: الحالة

source: Joining Date
ar: تاريخ الانضمام

source: Total Sales
ar: المبيعات

source: Closed Deals
ar: الصفقات المغلقة

source: Targets
ar: الأهداف

source: Latest Invoice
ar: آخر فاتورة

source: Latest Visit
ar: آخر زيارة

source: Login History
ar: تاريخ تسجيل الدخول

source: Location-Based Activities
ar: الأنشطة بناءً على الموقع

# task_completion
source: Task Completion Status
ar: حالة المهام الخاصة به

source: Monthly Sales
ar: المبيعات الشهرية

source: Product-wise Sales
ar: المبيعات حسب المنتج

source: Top Customers
ar: أفضل العملاء

source: Details
ar: تفاصيل

# delete_user
source: Are you sure you want to delete this user?
ar: هل أنت متأكد أنك تريد حذف هذا المستخدم؟

# delete_client
source: Are you sure you want to delete this client?
ar: هل أنت متأكد أنك تريد حذف هذا العميل؟

source: Confirm Deletion
ar: تأكيد الإزالة

# add_salesman
source: Add New Sales Man
ar: إضافة مندوب جديد

source: Field Required
ar: الحقل مطلوب

source: SalesMan Added
ar: تمت إضافة مندوب جديد

source: No Assigned Clients
ar: لا يوجد عملاء معينون

# salesman_creation
source: A new sales man has been created.
ar: لقد تم انشاء مندوب جديد

source: Error Adding Salesman
ar: حدث خطأ في إضافة المندوب

source: Full name
ar: الاسم الكامل

# name_error_2
source: Please enter both first and last name.
ar: الرجاء إدخال الاسم الأول والأخير.

# add_salesman_prompt
source: Please fill in all the fields to add a new sales man
ar: يرجى ملء جميع الحقول لإضافة مندوب مبيعات جديد.

# enter_salesman_name
source: Enter the sales man's name
ar: ادخل اسم مندوب المبيعات

# enter_salesman_password
source: Enter the sales man's password
ar: أدخل كلمة مرور مندوب المبيعات

# enter_salesman_phone
source: Enter the sales man's phone number
ar: أدخل رقم هاتف المندوب

# choose_region
source: Choose the sales man's region
ar: اختر منطقة مندوب المبيعات

# monthly_select_target
source: Monthly Target
ar: الهدف الشهري للمندوب

# daily_select_target
source: Daily Target
ar: الهدف اليومي للمندوب

# select_target_prompt
source: Enter the sales man's target
ar: ادخل الهدف لمندوب المبيعات

# target_error
source: Target must be greater than 0.
ar: يجب أن يكون الهدف أكبر من 0

source: Type
ar: النوع

# choose_salesman_type
source: Choose the sales man's type
ar: اختر نوع مندوب المبيعات

source: Notes
ar: ملاحظات

source: Add notes
ar: قم بإضافة ملاحظات

# type_error
source: The sales man's type can't be empty
ar: لا يمكن أن يكون نوع مندوب المبيعات فارغًا

source: Something Went Wrong
ar: حدث خطأ ما

source: Update
ar: تعديل

# salesman_updated
source: The salesman's information has been updated.
ar: تم تعديل معلومات المندوب بنجاح

# client_updated
source: The client's information has been updated.
ar: تم تعديل معلومات العميل بنجاح

source: Name
ar: الاسم

# add_client
source: Add New Client
ar: إضافة عميل جديد

# add_client_prompt
source: Please fill in all the fields to add a new client
ar: يرجى ملء جميع الحقول لإضافة عميل جديد.

source: Trade Name
ar: الاسم التجاري

source: Sales man name
ar: اسم مندوب المبيعات

source: Choose client type
ar: اختر نوع العميل

# enter_client_trade_name
source: Enter the client's trade name
ar: ادخل الاسم التجاري للعميل

# enter_client_phone
source: Enter the client's phone number
ar: ادخل رقم هاتف العميل

# enter_client_address
source: Enter the client's detailed address
ar: ادخل عنوان العميل التفصيلي

source: Address
ar: العنوان

# address_error
source: Please enter a valid address.
ar: يرجى ادخال عنوان صحيح

source: Change
ar: تغيير

# find_location
source: Find a specific location
ar: ابحث عن موقع محدد

source: Set Location
ar: تعيين الموقع

source: Location services are disabled.
ar: تم تعطيل خدمات الموقع.

source: Location permissions are denied
ar: تم رفض أذونات الموقع

# location_permissions
source: Location permissions are permanently denied, we cannot request permissions.
ar: تم رفض أذونات الموقع بشكل دائم، ولا يمكننا طلب الأذونات.

source: Location permission required
ar: مطلوب إذن الموقع

# person_in_charge
source: Name of the person in charge
ar: اسم الشخص المسؤول

# enter_person_in_charge
source: Enter the name of person in charge
ar: ادخل اسم الشخص المسؤول

source: Street
ar: الشارع

# enter_street
source: Enter street name
ar: ادخل اسم الشارع

source: Building Num.
ar: رقم البناية

# enter_building_num
source: Enter building number
ar: ادخل رقم البناية

# client_id
source: ID photo
ar: صورة الهوية

# enter_client_id
source: Enter client's ID photo
ar: ادخل صورة الهوية للعميل

source: Commercial Registration
ar: السجل التجاري

source: Profession License
ar: رخصة المهن

# additional_info
source: Additional Directions
ar: اتجاهات إضافية

# enter_additional_info
source: Enter additional directions of the client's location
ar: ادخل اتجاهات اضافية لموقع العميل

# client_creation
source: A new client has been created.
ar: لقد تم انشاء عميل جديد

# region_error
source: Please enter a valid region
ar: يرجى ادخال منطقة صحيحة

# building_error
source: Please enter a valid building number
ar: يرجى ادخال رقم بناية صحيح

# street_error
source: Please enter a valid street name
ar: يرجى ادخال اسم شارع صحيح

# choose_client_region
source: Choose the client's region
ar: اختر منطقة العميل

# no_photos_error
source: Please take the required photos
ar: يرجى التقاط الصور المطلوبة

source: ID photo required
ar: صورة الهوية مطلوبة

source: Commercial Registration photo required
ar: صورة السجل التجاري مطلوبة

source: Profession License photo required
ar: صورة عن رخصة المهن مطلوبة

source: Upload Photos
ar: قم بتحميل الصور

source: Delete
ar: حذف

source: Current location
ar: الموقع الحالي

source: Sales History
ar: سجل المبيعات

source: Average Order Value
ar: متوسط قيمة الطلب

# documents_section
source: Documents and Attachments
ar: المستندات والمرفقات

source: Daily Target
ar: الهدف اليومي

source: Monthly Target Achievement
ar: تحقيق الهدف الشهري

# next_visit
source: Next Scheduled Visit
ar: موعد الزيارة القادمة

source: Summary of Top Customers
ar: ملخص لأفضل العملاء

source: Load More ..
ar: تحميل المزيد ..

source: No clients found
ar: لا يوجد عملاء

source: North Amman
ar: شمال عمان

source: South Amman
ar: جنوب عمان

source: East Amman 1
ar: شرق عمان 1

source: East Amman 2
ar: شرق عمان 2

source: West Amman 1
ar: غرب عمان 1

source: West Amman 2
ar: غرب عمان 2

source: Zarqa and Russeifa
ar: الزرقاء والرصيفة

source: Retry
ar: إعادة المحاولة

source: Loading
ar: تحميل

source: No invoices available
ar: لا فواتير متاحة

source: No visits yet
ar: لا زيارات حتى الآن

source: No next visits scheduled
ar: لا توجد زيارات التالية مجدولة

source: Price
ar: السعر

# add_product
source: Add New Product
ar: إضافة منتج جديد

source: Product name
ar: اسم المتتج

source: Enter product name
ar: ادخل اسم المنتج

source: Description
ar: الوصف

# enter_description
source: Enter product's description
ar: ادخل الوصف للمنتج

# enter_price
source: Enter product's price
ar: ادخل سعر المنتج

source: Brand
ar: العلامة التجارية

# enter_brand
source: Enter brand's name
ar: ادخل اسم العلامة التجارية

source: Quantity
ar: الكمية

# enter_quantity
source: Enter avalilable quantity of the product
ar: ادخل الكمية المتوفرة من المنتج

source: Tax rate
ar: معدل الضريبة

source: Enter tax rate
ar: ادخل معدل الضريبة

# is_available
source: Is the product available?
ar: هل المنتج متوفر؟

# add_product_prompt
source: Please fill in all the fields to add a new product
ar: يرجى ملء جميع الحقول لإضافة منتج جديد.

# field_cant_be_empty
source: This field can't be empty
ar: لا يمكن أن يكون هذا الحقل فارغًا

source: Must be greater than zero
ar: يجب أن تكون القيمة أكبر من الصفر

# must_be_valid_percentage
source: Must be a valid percentage
ar: يجب أن تكون نسبة صحيحة

source: Discount cannot exceed 100%
ar: لا يمكن أن يتجاوز الخصم 100%

source: Tax rate cannot exceed 100%
ar: لا يمكن أن تتجاوز نسبة الضريبة 100%

source: Product added successfully
ar: تمت إضافة المنتج بنجاح

source: Product Updated
ar: تم تحديث المنتج

source: Product updated successfully
ar: تم تحديث المنتج بنجاح

source: No products yet
ar: لا توجد منتجات بعد

source: Update Product
ar: تحديث المنتج

source: No clients yet
ar: لا يوجد عملاء حتى الآن

source: No salesmen yet
ar: لا يوجد بائعون حتى الآن

source: Product added
ar: تمت إضافة المنتج

source: No
ar: لا

source: Created at
ar: تاريخ الإنشاء

source: Updated at
ar: تاريخ التعديل

source: Units sold
ar: الكمية المباعة

# delete_salesman
source: Delete User
ar: إزالة المندوب

source: Remove product
ar: إزالة المنتج

source: User not found
ar: المستخدم غير موجود

# user_not_found_in_db
source: User not found in database
ar: المستخدم غير موجود في قاعدة البيانات

source: Total Debt
ar: إجمالي الذمم

source: JD
ar: د.أ.

source: Top Performer
ar: أفضل مندوب

source: Assign Tasks
ar: تعيين المهام

source: Invoice
ar: الفاتورة

source: No unpaid invoices
ar: لا توجد فواتير غير مدفوعة
